Updated docs diagram
